app/controllers/items_controller.rb

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
  def show
    @item = Item.find(params[:id])