app/controllers/ownerships_controller.rb

SELECT  `items`.* FROM `items` WHERE `items`.`code` = 'rakutenkobo-ebooks:15335671' LIMIT 1
---
  def create
    @item = Item.find_or_initialize_by(code: params[:item_code])