app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @items = @user.items.uniq
    @count_want = @user.want_items.count
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `items` INNER JOIN `ownerships` ON `items`.`id` = `ownerships`.`item_id` WHERE `ownerships`.`type` IN ('Want') AND `ownerships`.`user_id` = 1

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('suzuki', 'suzuki@suzuki.com', '$2a$10$tzqy1cdqj1h6SrPnq9Td2.4n919Gw6NwNsCMt048OvQMYdLRQODi.', '2018-01-03 03:39:46', '2018-01-03 03:39:46')